src/InformationRegisters/Картинки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>Картинки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ХранилищеИзображения</Name>
					<Comment>Элемент справочника "Хранилище доп. информации", содержит файл картинки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеДополнительнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>URLСсылка</Name>
					<Comment>строковое представление ссылки на изображение во внешнем хранилище</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Comment>Дата добавления изображения в базу данных</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект, к которому привязана картинка</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Новость</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаРеализации</v8:Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКартинок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/Картинки/Forms/ЗагрузкаКартинокСпецифик/Ext/Form/Module.bsl
&НаСервере
Процедура ВыполнитьЗагрузкуНаСервере()
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузку(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	
	НачатьПоискФайлов(Новый ОписаниеОповещения("ПослеПоискаФайлов", ЭтотОбъект, ДополнительныеПараметры), КаталогСКартинками, "*.png", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПоискаФайлов(НайденныеФайлы, ДополнительныеПараметры) Экспорт 
	
	ЗаполнитьСписокНайденнымиФайлами(НайденныеФайлы);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокНайденнымиФайлами(НайденныеФайлы)
	
	RegExp = ирКэш.Получить().RegExp;
	RegExp.Pattern = "\d{8}.{1,}";

	Список.Очистить();
	Для каждого ТекФайл Из НайденныеФайлы Цикл
		
		ИмяБезРасширения = СокрЛП(ТекФайл.ИмяБезРасширения);
		Matches = RegExp.Execute(ИмяБезРасширения);
		Если НЕ Matches.Count = 1 Тогда
			Продолжить;
		КонецЕсли;
		
		НовСтрока = Список.Добавить();
		НовСтрока.КодСУП = Лев(ИмяБезРасширения, 8);
		НовСтрока.ПутьКФайлу = ТекФайл.ПолноеИмя;
		НовСтрока.Наименование = СокрЛП(СтрЗаменить(Сред(ИмяБезРасширения, 9), "_", " "));
		НовСтрока.ТипКартинки = ?(Прав(НовСтрока.Наименование, 3) = "160", ПредопределенноеЗначение("Справочник.ТипыКартинок.Специфика"), ПредопределенноеЗначение("Справочник.ТипыКартинок.СпецификаБольшая"));

	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ", Список.Выгрузить());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.КодСуп КАК КодСуп,
	|	ТЗ.ПутьКФайлу КАК ПутьКФайлу,
	|	ТЗ.Наименование КАК Наименование,
	|	ТЗ.ТипКартинки КАК ТипКартинки
	|ПОМЕСТИТЬ втСписок
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСписок.КодСуп КАК КодСуп,
	|	втСписок.ПутьКФайлу КАК ПутьКФайлу,
	|	втСписок.Наименование КАК Наименование,
	|	втСписок.ТипКартинки КАК ТипКартинки,
	|	Специфики.Ссылка КАК Объект
	|ПОМЕСТИТЬ втСписок2
	|ИЗ
	|	втСписок КАК втСписок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Специфики КАК Специфики
	|		ПО втСписок.КодСуп = Специфики.Номенклатура.КодСУП
	|			И (НЕ Специфики.Номенклатура.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСписок2.КодСуп КАК КодСуп,
	|	втСписок2.ПутьКФайлу КАК ПутьКФайлу,
	|	втСписок2.Наименование КАК Наименование,
	|	втСписок2.ТипКартинки КАК ТипКартинки,
	|	втСписок2.Объект КАК Объект,
	|	Картинки.ХранилищеИзображения КАК ХранилищеИзображения,
	|	ИСТИНА КАК Загрузить
	|ИЗ
	|	втСписок2 КАК втСписок2
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Картинки КАК Картинки
	|		ПО втСписок2.Объект = Картинки.Объект
	|			И втСписок2.ТипКартинки = Картинки.ТипКартинки";
	Список.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры


&НаКлиенте
Процедура КаталогСКартинкамиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Если Не ВыборФайла.Выбрать() Тогда
		Возврат;		
	КонецЕсли;
	КаталогСКартинками = ВыборФайла.ПолноеИмяФайла;
КонецПроцедуры
